{
  "backend/main.mo": "Main canister defining access control, user profiles, exercise planning types, calorie and measurement records, progress tracking types, and includes blob storage mixin.",
  "feature_evidence.json": "Empty feature evidence report with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files describing components, pages, and hooks.",
  "frontend/index.html": "HTML entry point loading frontend assets and favicon set, mounting the React app.",
  "frontend/ops/publish-draft-50-to-live.md": "Runbook describing how to promote Draft Version 50 to live, including verification, deployment steps, and rollback instructions.",
  "frontend/src/App.tsx": "Main React component managing authentication, profile setup flow, and routing to dashboard with theme provider and toaster.",
  "frontend/src/components/BurnedCalorieTracker.tsx": "Component for adding, editing, and displaying burned calorie entries with form handling, validation, and optional compact view.",
  "frontend/src/components/CalorieTracker.tsx": "Component for logging, editing, and charting calorie intake entries with validation, dialogs, and compact mode.",
  "frontend/src/components/ExercisePlanner.tsx": "Provides UI and logic to create, view, and delete weekly exercise plans, including adding exercises by day and category. Integrates with query hooks to manage planner state and display or clear the current week’s data.",
  "frontend/src/components/ExerciseTracker.tsx": "Displays the user’s daily exercise checklist with completion tracking, deletion, and streak calculation. Pulls today’s checklist and updates completion via query hooks.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, user greeting, profile edit button, and logout control. Manages profile dialog visibility.",
  "frontend/src/components/MeasurementsTracker.tsx": "Lets users record and edit body measurements, validating input and saving via query hooks. Displays measurement history and handles add/edit dialogs.",
  "frontend/src/components/MotivationCard.tsx": "Fetches and displays the daily motivational message with loading state handling. Uses a styled card layout for message and author.",
  "frontend/src/components/ProfileEditDialog.tsx": "Provides a dialog for updating name, email, and motivational preferences. Loads the current profile, validates changes, and saves updates via query hooks.",
  "frontend/src/components/ProgressPhotoGallery.tsx": "Shows a placeholder card for an upcoming progress photo upload feature. Includes alert messaging indicating the feature is not yet implemented.",
  "frontend/src/components/ProgressView.tsx": "Displays user fitness progress with charts and stats derived from weight, measurements, calories, exercise completion, and streak data.",
  "frontend/src/components/WeightTracker.tsx": "Provides UI for adding, editing, and charting weight records, including progress stats and optional compact mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication state, loading, login, logout, and identity persistence using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, weight, measurements, calories, progress, and related backend data.",
  "frontend/src/index.css": "Sets up Tailwind base styles and defines light/dark theme CSS variables for consistent UI styling.",
  "frontend/src/lib/generate-favicons.ts": "Generates heart-shaped favicon images programmatically and provides utilities to download PNG favicon files.",
  "frontend/src/main.tsx": "Bootstraps the app with React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main user dashboard with tabs for overview, tracking, exercise, photos, and progress, integrating various trackers and logout handling.",
  "frontend/src/pages/LoginPage.tsx": "Displays a login screen using Internet Identity with branded visuals, feature icons, and a sign‑in button.",
  "frontend/src/pages/ProfileSetup.tsx": "Provides a profile setup form allowing users to enter personal info, choose motivational style, and save their profile via a mutation.",
  "frontend/tailwind.config.js": "Defines TailwindCSS configuration including custom colors, animations, container settings, and plugins.",
  "project_state.json": "Stores the project’s current state, favicon fix requirements, architectural notes, and feature request metadata."
}