{
  "backend/main.mo": "Main Motoko canister providing access control initialization and queries plus extensive type definitions for user profiles, measurements, exercises, motivation, and calorie tracking.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference or documentation.",
  "frontend/index.html": "Base HTML entry point loading the frontend app and defining favicon assets.",
  "frontend/ops/publish-draft-50-to-live.md": "Runbook detailing steps to promote Draft Version 50 of the frontend to live production across multiple deployment methods.",
  "frontend/src/App.tsx": "Top-level React app controlling authentication flow, profile setup gating, and loading states.",
  "frontend/src/components/BurnedCalorieTracker.tsx": "Component for adding, editing, and displaying burned calorie entries with validation and optional compact mode.",
  "frontend/src/components/CalorieTracker.tsx": "Component for logging, editing, and charting calorie intake entries with error handling and a compact display option.",
  "frontend/src/components/ExercisePlanner.tsx": "Weekly exercise planner allowing users to add, delete, and manage exercises by day and category for the current week.",
  "frontend/src/components/ExerciseTracker.tsx": "Displays and manages daily exercise checklists, including completion toggles, streak calculation, and exercise removal.",
  "frontend/src/components/Header.tsx": "App header showing user greeting, profile edit button, and logout control.",
  "frontend/src/components/MeasurementsTracker.tsx": "Tracks body measurements with add and edit functionality, validating inputs and displaying progress.",
  "frontend/src/components/MotivationCard.tsx": "Shows the daily motivational quote fetched from the backend with loading state handling.",
  "frontend/src/components/ProfileEditDialog.tsx": "Modal for viewing and updating user profile details and preferences with validation.",
  "frontend/src/components/ProgressPhotoGallery.tsx": "Placeholder card indicating upcoming progress photo upload and gallery functionality.",
  "frontend/src/components/ProgressView.tsx": "Displays user progress metrics including weight, calories, exercise completion, and charts using data from backend queries.",
  "frontend/src/components/WeightTracker.tsx": "Manages weight entry, editing, and visualization with charts and backend mutations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, identity loading, and status management via React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data through the backend actor with error parsing.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light and dark themes.",
  "frontend/src/main.tsx": "Initializes the app root with React Query and Internet Identity providers.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page with tabbed sections for overview, tracking, exercise, photos, and progress, pulling user profile data and handling logout.",
  "frontend/src/pages/LoginPage.tsx": "Login screen using Internet Identity with branding, feature highlights, and a sign‑in button.",
  "frontend/src/pages/ProfileSetup.tsx": "Profile setup form allowing users to enter name, email, and preferences, then saving the profile via a mutation.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling custom colors, animations, container settings, and plugin integrations.",
  "project_state.json": "Metadata describing project state, favicon requirements, known issues, and feature requests for favicon generation and deployment."
}