{
  "backend/main.mo": "Main backend canister implementing access control, blob storage mixin, and numerous user fitness tracking types and models.",
  "feature_evidence.json": "Empty feature evidence report placeholder with no listed features.",
  "frontend-file-summaries.txt": "Prewritten summaries for various frontend files, describing their roles in the app.",
  "frontend/index.html": "HTML entry point loading the React frontend with favicon assets and main script.",
  "frontend/ops/publish-draft-50-to-live.md": "Runbook detailing steps to promote Draft Version 50 of the frontend to production.",
  "frontend/public/favicon.ico": "Favicon file; content placeholder present.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup routing, and dashboard rendering.",
  "frontend/src/components/BurnedCalorieTracker.tsx": "UI component for adding, editing, and displaying burned calorie entries with validation and dialogs.",
  "frontend/src/components/CalorieTracker.tsx": "UI component for calorie intake tracking with add/edit functionality and optional compact chart view.",
  "frontend/src/components/ExercisePlanner.tsx": "Weekly exercise planner allowing users to add, delete, and manage categorized exercises for each day with backend syncing.",
  "frontend/src/components/ExerciseTracker.tsx": "Displays today's exercises, tracks completion, supports deleting items, and calculates streaks from daily checklists.",
  "frontend/src/components/Header.tsx": "Header showing app title, user greeting, profile edit button, and logout functionality.",
  "frontend/src/components/MeasurementsTracker.tsx": "Manages body measurement entries, including adding, editing, validating, and displaying historical measurements.",
  "frontend/src/components/MotivationCard.tsx": "Fetches and displays the daily motivational quote with loading state handling.",
  "frontend/src/components/ProfileEditDialog.tsx": "Modal dialog allowing users to update profile details and motivational preferences, synced to backend.",
  "frontend/src/components/ProgressPhotoGallery.tsx": "Placeholder component announcing upcoming progress photo upload and gallery feature.",
  "frontend/src/components/ProgressView.tsx": "Displays progress metrics including weight, calories, streaks, and exercise completion using data fetched from backend hooks and rendered in charts.",
  "frontend/src/components/WeightTracker.tsx": "Manages adding, editing, and charting weight records with form dialogs and progress stats.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user data through the backend actor with error parsing and cache invalidation.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes.",
  "frontend/src/lib/generate-favicons.ts": "Generates and downloads themed heart-shaped favicon images using canvas.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabbed views for tracking weight, calories, exercise, photos, and progress, using user profile data and logout handling.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login screen that triggers Internet Identity authentication and highlights app features.",
  "frontend/src/pages/ProfileSetup.tsx": "Provides a form for creating and saving a user profile including name, email, and motivational preferences.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom colors, themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes project state, decisions, and requirements focused on regenerating and integrating a new favicon set."
}