{
  "backend/main.mo": "Main Motoko canister defining access control, blob storage, and all fitness‑tracking data types such as profiles, measurements, exercise plans, logs, and calorie entries.",
  "feature_evidence.json": "Feature evidence report placeholder with an empty features list.",
  "frontend-file-summaries.txt": "Text file containing prewritten summaries for various frontend files.",
  "frontend/index.html": "HTML entry point loading the React app and linking favicon assets.",
  "frontend/ops/publish-draft-50-to-live.md": "Runbook detailing steps to promote Draft Version 50 to live production and verification procedures.",
  "frontend/src/App.tsx": "Main React component handling authentication, profile setup flow, and dashboard rendering with theming and notifications.",
  "frontend/src/components/BurnedCalorieTracker.tsx": "Component for adding, editing, and viewing burned‑calorie entries with validation and optional compact view.",
  "frontend/src/components/CalorieTracker.tsx": "Component for managing calorie intake entries, including add/edit dialogs and optional chart and compact display.",
  "frontend/src/components/ExercisePlanner.tsx": "Manages weekly exercise planning, allowing users to add, organize, and delete exercises by day and category. Integrates with backend queries to handle the current week's plan and checklists.",
  "frontend/src/components/ExerciseTracker.tsx": "Displays and manages daily exercise checklists, including completion toggling, deletion, and streak calculation. Pulls today's checklist based on the system date.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, user greeting, profile editing trigger, and logout button. Controls visibility of the profile edit dialog.",
  "frontend/src/components/MeasurementsTracker.tsx": "Handles adding, viewing, and editing body measurements with validation and backend updates. Displays historical measurements and supports inline editing through dialogs.",
  "frontend/src/components/MotivationCard.tsx": "Fetches and displays the daily motivational saying with a loading state. Shows a styled quote card with message and author.",
  "frontend/src/components/ProfileEditDialog.tsx": "Provides a dialog for editing user profile details and motivational preferences with validation. Loads existing profile data and saves updates via backend mutation.",
  "frontend/src/components/ProgressPhotoGallery.tsx": "Placeholder component for future photo upload and gallery features. Shows a coming-soon alert and static preview messaging.",
  "frontend/src/components/ProgressView.tsx": "Displays user progress metrics by fetching backend data and rendering charts for workouts, calories, weight, and streaks.",
  "frontend/src/components/WeightTracker.tsx": "Manages weight records with add/edit functionality and displays weight trends in a line chart, optionally in compact mode.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and identity persistence using Dfinity AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query hooks for fetching and mutating user data such as profiles, measurements, weight, and progress.",
  "frontend/src/index.css": "Defines Tailwind CSS layers and theme variables for light and dark modes.",
  "frontend/src/lib/generate-favicons.ts": "Generates heart‑shaped favicon images on a canvas and provides utilities to download them in multiple sizes.",
  "frontend/src/main.tsx": "Bootstraps the React app with Internet Identity and React Query providers and loads global styles.",
  "frontend/src/pages/Dashboard.tsx": "Implements the main dashboard with tabbed sections for overview, tracking, exercise planning, photos, and progress, using user profile data and various tracker components.",
  "frontend/src/pages/LoginPage.tsx": "Renders the login screen with Internet Identity authentication, branding visuals, and feature highlights.",
  "frontend/src/pages/ProfileSetup.tsx": "Provides a form for creating a user profile including name, email, motivational style, and sharing preferences, saving via backend hooks.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme extensions, colors, animations, container settings, and plugins.",
  "project_state.json": "Tracks project state, favicon-related issues, required image assets, and existing feature metadata."
}