{
  "backend/main.mo": "Main backend canister initializing access control, blob storage, and defining all user, exercise, measurement, calorie, motivation, and progress-related data types.",
  "feature_evidence.json": "Feature evidence report listing favicon‑related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file, mainly React components, hooks, and styles.",
  "frontend/index.html": "HTML entry point referencing generated favicon PNGs and loading the main React application.",
  "frontend/ops/publish-draft-50-to-live.md": "Runbook detailing steps to promote Draft Version 50 to production and verifying deployment success.",
  "frontend/public/favicon.ico": "Binary favicon placeholder referenced in feature evidence.",
  "frontend/src/App.tsx": "Top‑level React component handling authentication logic, profile setup flow, and routing to the dashboard.",
  "frontend/src/components/BurnedCalorieTracker.tsx": "Component for adding, editing, and displaying burned‑calorie entries with validation and toast‑based error handling.",
  "frontend/src/components/CalorieTracker.tsx": "Tracks calorie entries with add and edit dialogs and displays stats and a chart.",
  "frontend/src/components/ExercisePlanner.tsx": "Manages weekly exercise plans, allowing users to add exercises by day and category and delete the current week's plan.",
  "frontend/src/components/ExerciseTracker.tsx": "Shows daily exercise checklist, supports marking exercises complete, deleting them, and calculates a streak.",
  "frontend/src/components/Header.tsx": "Displays the app header with user greeting, profile edit button, and logout.",
  "frontend/src/components/MeasurementsTracker.tsx": "Records and updates body measurements and shows latest and initial measurement comparisons.",
  "frontend/src/components/MotivationCard.tsx": "Fetches and displays the daily motivational saying with a loading state.",
  "frontend/src/components/ProfileEditDialog.tsx": "Provides a dialog for editing user profile details and motivational preferences.",
  "frontend/src/components/ProgressPhotoGallery.tsx": "Displays a placeholder card for an upcoming progress photo upload feature with alerts and icons.",
  "frontend/src/components/ProgressView.tsx": "Aggregates weight, measurement, calorie, and workout progress data and renders various charts and stats.",
  "frontend/src/components/WeightTracker.tsx": "Manages weight entry creation and editing, and displays weight history with charts and progress stats.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor and refreshes dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login, and logout handling using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profile, measurements, weight, calories, progress, and other backend data.",
  "frontend/src/index.css": "Tailwind base styles and theme variables for light and dark modes, including color and layout tokens.",
  "frontend/src/lib/generate-favicons.ts": "Generates heart-themed favicon PNGs using canvas and provides a helper to download them along with a list of standard favicon sizes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main authenticated dashboard with tabs for tracking weight, calories, exercise, photos, and progress.",
  "frontend/src/pages/LoginPage.tsx": "Displays a styled login screen using Internet Identity with branding and feature highlights.",
  "frontend/src/pages/ProfileSetup.tsx": "Provides a form for creating a user profile with name, email, motivational style, and preferences.",
  "frontend/tailwind.config.js": "Defines TailwindCSS configuration with extended colors, animations, plugins, and container settings.",
  "project_state.json": "Stores project metadata, favicon regeneration requirements, known issues, and feature definitions."
}