{
  "kind": "build_request",
  "title": "Fix missing favicon assets so the pink-heart icon displays in the browser tab",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add the missing favicon image files under `frontend/public/assets/generated/` using the exact filenames referenced by `frontend/index.html` so the browser can successfully load them at runtime.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-9"
        ],
        "quotes": [
          "The icon is still not showing on the tap on top of the screen.",
          "please do"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/public/assets/generated/` contains all of the following files: `favicon-16.dim_16x16.png`, `favicon-32.dim_32x32.png`, `apple-touch-icon.dim_180x180.png`, `android-chrome-192.dim_192x192.png`, `android-chrome-512.dim_512x512.png`",
        "In a production build, requesting each of the above paths returns HTTP 200 (not 404)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Generate a consistent favicon image set that is a very simple pink heart on a transparent background (no white circular background), exported at the standard favicon sizes used by the app, and ensure each generated image is visually crisp and centered at its target size.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-8",
          "msg-9"
        ],
        "quotes": [
          "If you want, I can regenerate the transparent‑pink‑heart favicon set again and make sure the files are actually added this time.",
          "please do"
        ]
      },
      "acceptanceCriteria": [
        "Each required favicon file is a simple pink heart on a transparent background, centered within the canvas.",
        "The 16x16 and 32x32 icons remain recognizable (not overly detailed) and are not clipped.",
        "No additional background shape (e.g., white circle) is present in the exported assets."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Verify that `frontend/index.html` favicon `<link>` tags resolve to the generated assets and keep the filenames/paths aligned with the assets in `frontend/public/assets/generated/` (update the HTML only if needed to match the generated filenames).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7",
          "msg-8"
        ],
        "quotes": [
          "Your `index.html` is expecting files like: ... But the `assets/generated` folder is completely empty.",
          "HTML is wired correctly, but the actual favicon image files were never created or placed in that folder."
        ]
      },
      "acceptanceCriteria": [
        "The `href` values in `frontend/index.html` for favicon-related `<link>` tags each correspond to an existing file in `frontend/public`.",
        "After deployment and a hard refresh, the browser tab shows the new pink-heart favicon (allowing for normal browser favicon caching behavior)."
      ]
    }
  ],
  "constraints": [
    "Frontend immutable paths must not be edited: `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/components/ui`.",
    "Do not introduce new backend canisters or external services; keep the existing single-actor Motoko backend unchanged unless strictly necessary for the favicon fix.",
    "Store generated images as static assets in `frontend/public/assets/generated/` (do not route image delivery through the backend)."
  ],
  "nonGoals": [
    "Adding new app features unrelated to favicon display.",
    "Changing authentication or Internet Identity behavior.",
    "Replacing the app logo/branding elsewhere in the UI (header, login page, etc.) unless explicitly requested."
  ],
  "imageRequirements": {
    "required": [
      "Very simple pink heart on a transparent background (favicon-16.dim_16x16.png, 16x16)",
      "Very simple pink heart on a transparent background (favicon-32.dim_32x32.png, 32x32)",
      "Very simple pink heart on a transparent background (apple-touch-icon.dim_180x180.png, 180x180)",
      "Very simple pink heart on a transparent background (android-chrome-192.dim_192x192.png, 192x192)",
      "Very simple pink heart on a transparent background (android-chrome-512.dim_512x512.png, 512x512)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}